modules/registrator/views/layouts/reg.php

                    <p>
                        <?php
                        $user =Yii::$app->user->identity->getId();
                        $name = \app\models\Myusers::findOne(['id'=>$user]);
---
SELECT * FROM `users` WHERE `id`=2