controllers/SiteController.php

SELECT * FROM `users` WHERE `id`=2
---
    public function actionLogin()
    {
        if (!Yii::$app->user->isGuest) {
            return $this->goHome();
        }

        $model = new LoginForm();
        if ($model->load(Yii::$app->request->post()) && $model->login()) {
         //   return $this->goBack();
            $user =Yii::$app->user->identity->getId();
            $role =Myusers::findOne(['id'=>$user]);