modules/registrator/controllers/ClientController.php

SELECT * FROM `visit` WHERE `client_id`='19'
---
    public function actionView($id)
    {
        $my = new Myusers();
        $bemor = new Clients();
        if ($my->load(Yii::$app->request->post()) && $bemor->load(Yii::$app->request->post())) {
            $doctor_id = $_POST{'Myusers'}['id'];
            $reg_id = Yii::$app->user->identity->getId();
//              Visit::create($reg_id,)

            $client_id = $_POST{'Clients'}['id'];

            $t1 = new Visit();
            $t1::create($client_id, $reg_id);
            $visit = $t1::findOne(['client_id' => $client_id])->getAttribute('id');

INSERT INTO `clients` (`surname`, `name`, `midname`, `birth_date`, `home_phone`, `sex`, `work_phone`, `work_place`, `region_id`, `district_id`, `address`) VALUES ('5', '5', '5', '5', '5', 1, '5', '5', 2, 1, '5')
---
    public function actionCreate()
    {
        $model = new Clients();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM `clients` WHERE `id`='19'
---
    protected function findModel($id)
    {
        if (($model = Clients::findOne($id)) !== null) {