modules/registrator/views/client/_form.php

SELECT * FROM `region`
SELECT * FROM `district`
---
   <div class="col-md-4">
       <?= $form->field($model, 'work_phone')->textInput(['maxlength' => true]) ?>
       <?= $form->field($model, 'work_place')->textInput(['maxlength' => true])?>
       <?= $form->field($model, 'region_id')->dropDownList(
               \yii\helpers\ArrayHelper::map(\app\models\Region::find()->asArray()->all(),'id','name')
       )?>
       <?= $form->field($model, 'district_id')->dropDownList(\yii\helpers\ArrayHelper::map(\app\models\District::find()->asArray()->all(),'id','name')) ?>