modules/registrator/views/client/view.php

                     'label'=>'Jinsi',
                      'attribute'=>'sex',
                'value'=>function($model){
                 $jinsi =\app\models\Jinsi::findOne(['id'=>$model->sex]);
---
SELECT * FROM `sex` WHERE `id`=1

               ?>
               <?php $form =\yii\widgets\ActiveForm::begin()?>

               <?= $form->field($use,'id')->dropDownList(
                   \yii\helpers\ArrayHelper::map(\app\models\Myusers::find()->where(['role'=>$use->role])->asArray()->all(),'id','name')
               )->label("Doctor qabuliga yozish")?>
---
SELECT * FROM `users` WHERE `role`=3