models/Myusers.php

SELECT * FROM `users` WHERE `id`=2
---
    public static function findIdentity($id)
    {
        return static::findOne($id);

SELECT * FROM `users` WHERE `username`='reg'
---
    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username]);

SELECT * FROM `users` WHERE `role`=3
---
     public  static function  getRole($role){
        return static ::findOne(['role'=>$role]);