models/Visit.php

    public static function create($client_id ,$userid){
        $stmt = Visit::findAll(['client_id'=>$client_id,'inside'=>1]);
        if(!$stmt){
            $visit = new Visit;
            $visit->client_Id = $client_id;
            $visit->visit_time = time();
            $visit->reg_id = $userid;
            $visit->out_time = 0;
            $visit->inside = 1;
            $visit->save();
---
SELECT * FROM `visit` WHERE (`client_id`='19') AND (`inside`=1)
INSERT INTO `visit` (`client_Id`, `visit_time`, `reg_id`, `out_time`, `inside`) VALUES (19, 1549016542, 2, 0, 1)